Repository: lawrancej/logisim
Catalog: xlate/ru/doc/omegat-logisim-doc_ru-omegat.tmx
Source language: en
Languages: ru_ru

source: Logisim will only analyze circuits with at most eight of each type, and all should be single-bit pins.
ru_ru: Logisim будет анализировать только схемы, содержащие не более восьми контактов каждого типа, и все они должны быть однобитными.

source: In the middle is an indicator of what file is being logged to.
ru_ru: По середине - индикатор того, в какой файл ведётся запись журнала.

source: If you want to alter a circuit in a loaded Logisim library, then you need to open it separately within Logisim.
ru_ru: Если вы хотите изменить схему в загруженной библиотеке Logisim, то вам придётся открыть её в Logisim отдельно.

source: Note: The term splitter is a non-standard term, which is unique to Logisim as far as I know.
ru_ru: Примечание: Термин разветвитель не является стандартным термином; он является уникальным для Logisim, насколько я знаю.

source: NOT Gate
ru_ru: Элемент НЕ

source: The number of outputs for the decoder will be 2selectBits.
ru_ru: Количество выходов для декодера будет равно 2Выбирающие_биты .

source: The Arithmetic library includes combinational components that perform arithmetic operations on unsigned and two's-complement values.
ru_ru: Библиотека Арифметика включает комбинационные компоненты, которые выполняют арифметические действия над значениями в виде беззнаковых чисел и в дополнительном коде.

source: South edge, east end (input, bit width 1)
ru_ru: Южный край, восточный контакт (вход, разрядность равна 1)

source: One particularly notable instance of Gray codes is along the axes in Karnaugh maps.
ru_ru: Один из наиболее заметных примеров использования кода Грея - вдоль осей в картах Карно.

source: /** Returns a list of all the tools available in this library.
ru_ru: /** Возвращает список всех инструментов, доступных в этой библиотеке.

source: Spanish
ru_ru: Испанский

source: While more intuitive, this behavior requires more mouse movement to switch between tools.)
ru_ru: Хотя такое поведение более интуитивно, оно требует больше перемещений мыши для переключения между инструментами.)

source: This orientation to the Logisim libraries concludes with a fairly sophisticated Gray code counter that allows the user to alter its current value using the Poke Tool and to place a label on the component using the Text Tool.
ru_ru: Этот курс по библиотекам Logisim завершается довольно сложным счётчиком кода Грея, который позволяет пользователю менять его текущее значение, используя Инструмент Нажатие и размещать на компоненте метку, используя Инструмент Текст.

source: Data values, one of which is to be routed to the output.
ru_ru: Значения данных, одно из которых должно быть направлен на выход.

source: In any case, once you enter the subcircuit, you'll see that the pins' values in the subcircuit match the values being sent through them from the containing circuit.
ru_ru: В любом случае, проникнув в состояние подсхемы, вы увидите, что значения на контактах подсхемы соответствуют значениям, посылаемым в неё содержащей её схемой.

source: The solution is to create a new class for representing the object's current state, and to associate instances of this with the component through the parent circuit's state.
ru_ru: Решение состоит в том, чтобы создать новый класс для представления текущего состояния объекта, и ассоциировать его экземпляры с компонентом через состояние родительской схемы.

source: Default appearance
ru_ru: Внешний вид по умолчанию

source: By default, the clock triggers on a rising edge — that is, when the clock input changes from 0 to 1.
ru_ru: По умолчанию тактовый вход срабатывает при переднем фронте - то есть когда значение на тактовом входе меняется с 0 на 1.

source: Like the components of the Gates library, all are combinational, but their purpose is generally for routing values.
ru_ru: Как и компоненты библиотеки Элементы, все компоненты - комбинационные, но их назначение - в основном перенаправление значений.

source: But a user building a circuit using several subcircuits (as described in the `Subcircuits' section of the User's Guide) will use pins also to specify the interface between a circuit and a subcircuit.
ru_ru: Но пользователь, строящий схему с использованием нескольких подсхем (как описано в разделе "Подсхемы" Руководства пользователя ) будет использовать контакты также чтобы определить интерфейс между схемой и подсхемой.

source: Tutorial: Adding gates
ru_ru: Пособие: Добавление логических элементов

source: Typing hexadecimal characters will alter the currently selected value.
ru_ru: Ввод шестнадцатеричных символов будет изменять выбранное значение.

source: For example, if Data Bits were 8, this input would require 3 bits; but if it were 9, it would require 4 bits.
ru_ru: Например, если значение Биты данных равно 8, то этот вход должен иметь 3 бита; но если оно равно 9, то потребуются 4 бита.

source: Clicking a wire displays temporarily the value, staying until the user clicks elsewhere in the circuit.
ru_ru: Щелчок на проводе временно отображает значение, пока пользователь не щёлкнет в другом месте схемы.

source: Another way of describing the different behavior of the flip-flops is in English text.
ru_ru: Другой способ описания поведения различных триггеров - обычный текст.

source: License
ru_ru: Лицензия

source: Each character typed will then be inserted into the buffer, as long as the buffer hasn't reached its capacity and the character is one of those that the component supports: the printable characters within the 7-bit ASCII code, as well as space, backspace, newline, and control-L.
ru_ru: Каждый введённый символ будет помещаться в буфер, пока буфер не достиг предела вместимости, и если символ - один из поддерживаемых компонентом: печатаемые символы ASCII кода, а также пробел, символ перехода на новую строку, Backspace и Control-L.

source: Length
ru_ru: Длина

source: Input/Output library
ru_ru: Библиотека Ввод/вывод

source: Vertical Alignment
ru_ru: Вертикальное выравнивание

source: Opens the help system to the "Beginner's Tutorial" section of the Guide to Being a Logisim User.
ru_ru: Открывает справочную систему на разделе "Пособие начинающего" руководства "Как стать пользователем Logisim".

source: And the last parameter is its
ru_ru: И последний параметр - это его

source: stating that you changed the files and the date of any change.
ru_ru: содержащими указания на то, что вы изменили файлы, и дату каждого изменения.

source: By default, any inputs that are left unconnected are ignored — that's if the input truly has nothing attached to it, not even a wire.
ru_ru: По умолчанию, неподключенные входы игнорируются - то есть, если входы действительно не имеют ничего подключенного к ним - даже провода.

source: clr on south edge (input, bit width 1)
ru_ru: clr на южном крае (вход, разрядность равна 1)

source: D on east edge (input/output, bit width matches Data Bit Width attribute)
ru_ru: D на восточном крае (вход/выход, разрядность соответствует атрибуту Разрядность данных)

source: (The same applies to the ordering of outputs.)
ru_ru: (То же самое относится и к порядку выходов).

source: years, to give any third party, for a charge no more than your
ru_ru: лет, предоставить любому третьему лицу за вознаграждение не большее стоимости

source: The clock and data inputs are ignored when Write Enable is 0.
ru_ru: Тактовый вход и вход Данные игнорируются, когда значение на входе Разрешение записи - 0.

source: All wires in Logisim are either horizontal or vertical, never diagonal.
ru_ru: Все провода в Logisim либо горизонтальные, либо вертикальные; диагональных не бывает.

source: If the selection is overlapped by several objects, it is raised only to be above the lowest one; select the menu item repeatedly until it is in the order it should be.
ru_ru: Если выделение перекрывается несколькими объектами, то оно поднимается только выше самого нижнего из них; используйте этот пункт меню несколько раз подряд, пока объект не окажется в нужном месте.

source: Tutorial: Adding text
ru_ru: Пособие: Добавление текста

source: If the input happens to be the least negative value representable in dataBits bits, however, then the output matches the input.
ru_ru: Если значение на входе оказалось наименьшим по модулю отрицательным значением, представляемым битыДанных битами, то выходное значение будет совпадать со входным.

source: And it does not normally constitute a major problem: Logisim will draw the full selection in the midst of dropping, and you should not drop it until you are sure it is in the correct location.
ru_ru: И это обычно не представляют собой серьезную проблему: Logisim будет полностью переносить выделение туда, куда вы его перетащили, и вам не следует отпускать его, пока вы не уверены, что оно находится в правильном месте.

source: If you decide you don't like where you placed something, then you can select it using the Edit tool () and drag it to the desired spot.
ru_ru: Если вы решили, что вам не нравится, где вы разместили что-то, то вы можете выбрать это с помощью Инструмента Правка () и перетащить в нужное место.

source: In the classroom example, you will have many files that you wish to test for their equivalence, and you won't want to read the output for each of the student's solutions.
ru_ru: В случае проведения занятий в классе у вас будет много файлов, которые вам нужно проверить на эквивалентность, и вам не захочется читать вывод для решения каждого учащегося.

source: Boolean expressions, which allow an algebraic representation of how the circuit works
ru_ru: логические выражения, которые дают алгебраическое представление о том, как работает схема

source: The bit width of the output is the minimum number of bits to store the maximum possible value (which would be the product of the Data Bits attribute and the Number of Inputs attribute).
ru_ru: Разрядность выхода - это минимальное число битов для хранения максимально возможного значения (которое будет произведением атрибутов Биты данных и Количество входов).

source: (If you chose to reduce the number of inputs to 3, the AND gate would not have vertical extension on the left side.
ru_ru: (Если вы решили уменьшить число входов до 3, то элемент И не будет иметь вертикальное расширение на левой стороне.

source: The current value continues to appear on the output.
ru_ru: Текущее значение по-прежнему поступает на выход.

source: Next: Step 1: Adding gates
ru_ru: Далее: Шаг 1: Добавление логических элементов

source: The same functionality can be achieved using the more versatile Constant component.
ru_ru: Такая же функциональность может быть достигнута с помощью более гибкого компонента Константа.

source: The component's p-gate input.
ru_ru: Вход p-затвор компонента.

source: The text tool allows you to create and edit labels associated with components.
ru_ru: Инструмент Текст позволяет создавать и редактировать метки, привязанные к компонентам.

source: One exception: The subcircuit inputs are determined based on the values coming into the circuit from the supercircuit, so it doesn't make sense to toggle those values.
ru_ru: Одно исключение: значения на входах подсхемы определяются исходя из значений, поступающих в схему из надсхемы, поэтому не имеет смысла менять эти значения.

source: /** The last clock input value observed.
ru_ru: /** Последнее наблюдаемое значение на тактовом входе.

source: It lowers the currently selected object(s) so that it is drawn (or they are drawn) below an object that the selection currently overlaps.
ru_ru: Он опускает выделенный в данный момент объект(ы) так, чтобы он оказался под объектом, перекрывающим выделение.

source: Some components draw short stubs to which wires can connect, such as the OR gate and controlled buffer.
ru_ru: Некоторые компоненты рисуют короткие отрезки, к которым могут быть подключены провода - такие как Элемент ИЛИ и Управляемый буфер.

source: // setPorts above) the output is at index 1.
ru_ru: // setPorts выше) выход имеет индекс 1.

source: In this section, we'll examine how to use the other two major regions of the Logisim window, the explorer pane and the attribute table.
ru_ru: В этом разделе мы рассмотрим, как использовать другие две основные области окна Logisim: панель проводника и таблицу атрибутов.

source: The analysis process will only be valid for combinational circuits.
ru_ru: Процесс анализа будет иметь смысл только для комбинационных схем.

source: The component takes a multi-bit input and determines the the index of a bit, where the index is computed by counting from 0 as the lowest-order bit.
ru_ru: Компонент принимает многобитное значение на входе и определяет номер бита, причём номер бита отсчитывается от 0-го как от младшего бита.

source: (Some computers use another keys for menus, such as the Command key on Macintoshes.
ru_ru: (Некоторые компьютеры используют другие клавиши для меню, такие как клавиша Command на Макинтошах.

source: Saves the currently viewed project, overwriting what was previously in the file.
ru_ru: Сохраняет просматриваемый в данный момент проект, перезаписывая то, что было раньше в файле.

source: The location of the label relative to the component.
ru_ru: Расположение метки относительно компонента.

source: This component includes two inputs, data and dist, and it has one output, which is the result of shifting data by dist places.
ru_ru: Этот компонент включает два входа: данные и дистанция, и имеет один выход, значение на котором - результат сдвига данные на дистанция позиций.

source: gate
ru_ru: затвор

source: Transistor
ru_ru: Транзистор

source: Switches to allow you to edit the layout of components, which determines how the circuit works.
ru_ru: Переключает вас на режим редактирования чертежа расположения компонентов, который определяет, как работает схема.

source: By poking the switches through different combinations, we can verify the other two rows.
ru_ru: Переключая Инструментом Нажатие разные комбинации, мы можем проверить оставшиеся две строки.

source: Or in summarized form:
ru_ru: Или в краткой форме:

source: Next: Guidelines.
ru_ru: Далее: Указания.

source: When it is 1 or floating, a clock pulse will result in storing the data found on the west edge into memory (provided the sel input is also 1 or floating).
ru_ru: Когда на нём 1 или плавающее значение, тактовый импульс приведёт к записи в память данных, полученных на западном крае (при условии, что на входе sel тоже 1 или плавающее значение).

source: The color to display when the input value is 1.
ru_ru: Цвет, отображаемый, когда на входе 1.

source: You may not impose any further restrictions on the recipients' exercise of the rights granted herein.
ru_ru: Вы не можете налагать каких-либо дополнительных ограничений на осуществление получателем прав, предоставленных данным документом.

source: The comparison is performed starting at the most significant bits in each number and descending downward in parallel until a location is found where the two values disagree.
ru_ru: Сравнение производится начиная с наиболее значимых битов в каждом числе, спускаясь вниз до места, где найдены два различающихся значения.

source: See the GNU General Public License for more details.
ru_ru: См. Универсальную Общественную Лицензию GNU для более подробной информации.

source: Finally, any free program is threatened constantly by software patents.
ru_ru: И наконец, каждой свободной программе постоянно угрожают патенты на ПО.

source: The internal simulation uses a hidden clock for its simulation, and to provide a somewhat realistic simulation, each component (excluding wires and splitters) has a delay between when it receives an input and when it emits an output.
ru_ru: Внутреннее моделирование использует скрытый тактовый генератор для имитации такого шума, и для обеспечения в некоторой степени реалистичного моделирования каждый компонент (кроме проводов и разветвителей) имеет задержку между получением сигналов на входе и выдачей сигнала на выходе.

source: Options include zero and floating; in the latter case, the outputs are effectively disconnected from any other ports.
ru_ru: Существуют варианты "ноль" и "плавающее"; в последнем случае выходы фактически отключены от всех других контактов.

source: If you do have a blue or a gray wire after you think everything ought to be connected, then something is going wrong.
ru_ru: Если у вас есть синий или серый провод когда вы думаете, что всё уже соединено, значит что-то пошло не так.

source: Select the poke tool () and start poking the inputs by clicking on them.
ru_ru: Выберите Инструмент Нажатие () и начните менять значения на входах, щёлкая на них.

source: Fan Out
ru_ru: Веерный выход

source: If any of the inputs are the error value (e.g., if conflicting values are coming into the same wire) or floating, then the output will be the error value.
ru_ru: Если на каких-либо входах значение ошибки (например, если противоречивые значения поступают на один и тот же провод) или плавающее значение, то на выходе будет значение ошибки.

source: Recursive: The number of times that component appears in the circuit's hierarchy, where we count each subcircuit as many times as it appears in the hierarchy.
ru_ru: Рекурсивно: сколько раз компонент встречается в иерархии схемы, при условии, что каждая подсхема считается столько раз, сколько она встречается в иерархии.

source: The value rising edge indicates that the counter should update its value at the instant when the clock rises from 0 to 1.
ru_ru: Значение Передний фронт означает, что счётчик должен обновляться в момент, когда значение на тактовом входе меняется с 0 на 1.

source: As we will see on the next page, the Boolean expressions are particularly useful because the Combinational Analysis window will use these when told to build a circuit corresponding to the current state.
ru_ru: Как мы увидим на следующей странице, логические выражения особенно полезны, потому что окно Комбинационный анализ будет использовать их, когда мы укажем ему построить схему, соответствующую текущему состоянию.

source: Lower Selection
ru_ru: Опустить выделение

source: Outputs the value currently stored by the flip-flop.
ru_ru: Выдаёт значение, хранящееся в данный момент в триггере.

source: Paste
ru_ru: Вставить

source: The interface to the component varies depending on the value of the Input Format attribute.
ru_ru: Интерфейс доступа к компоненту варьируется в зависимости от значения атрибута Формат входа.

source: Logging...
ru_ru: Запись в журнал...

source: The subcircuit concept is analogous to this, and it serves the same purpose: To break a large job into bite-sized pieces, to save the effort of defining the same concept multiple times, and to facilitate debugging.
ru_ru: Концепция подсхемы - аналог этого, и она используется для тех же целей: чтобы разбить большую задачу на меньшие части, чтобы сэкономить усилия на многократном определении одних и тех же понятий, и чтобы облегчить отладку.

source: Preferences
ru_ru: Настройки

source: Configures which of the three interfaces are used for communicating data into and out of the component.
ru_ru: Определяет, какой из трёх интерфейсов использовать для передачи данных в и из компонента.

source: When you select a port, Logisim will indicate the corresponding pin by popping up a miniature diagram of the layout in the window's bottom right corner, with the corresponding pin(s) drawn in blue.
ru_ru: Когда вы выбираете порт, Logisim указывает соответствующий контакт с помощью небольшой всплывающей в нижнем правом углу окна диаграммы, на которой соответствующий контакт(ы) показан синим.

source: As you build circuits that are more and more sophisticated, you will want to build smaller circuits that you can use multiple times as a module nested within larger circuits.
ru_ru: По мере того, как вы строите всё более и более сложные схемы, вы захотите строить меньшие схемы, которые вы могли бы использовать многократно как модули, вложенные в большие схемы.

source: The bit width of the component's select input on its south edge.
ru_ru: Разрядность выбирающего входа компонента на его южном крае.

source: Selects all components in the current circuit.
ru_ru: Выбирает все компоненты в текущей схеме.

source: The buffer simply passes through to its right output whatever input it receives on the left side.
ru_ru: Буфер просто пропускает на свой правый выход значение, полученное на входе с левой стороны.

source: Multiplier
ru_ru: Множитель

source: When the value is 0 or unknown (i.e., floating), then the component's output is also floating.
ru_ru: Если же значение равно 0 или неизвестно (например, плавающее), то значение на выходе компонента тоже плавающее.

source: In all other cases, drain receives an error output.
ru_ru: Во всех остальных случаях со сток поступает значение ошибки.

source: Notice the five dots on the left side of the AND gate.
ru_ru: Обратите внимание на пять точек на левой стороне элемента И.

source: Gray code is a technique (named after Frank Gray) for iterating through n-bit sequences with only one bit changed for each step.
ru_ru: Код Грея - это техника (по имени Фрэнка Грея) для итерации n-битной последовательности с изменением только одного бита на каждом шаге.

source: Select Bits
ru_ru: Выбирающие биты

source: The output's bit width.
ru_ru: Разрядность выходного значения.

source: The number of split ends is specified in the Fan Out attribute, and each split end has an index that is at least 0 and less than the Fan Out attribute.
ru_ru: Число разделённых концов указано в атрибуте Веерный выход, и каждый разделённый конец имеет номер от нуля до значения атрибута Веерный выход не включительно.

source: East edge, south end (output, bit width 1)
ru_ru: Восточный край, южный контакт (выход, разрядность равна 1)

source: Shaped
ru_ru: Фигурные

source: (Roughly, each character must either a letter or a digit, and the first character must be a letter.
ru_ru: (Вкратце, каждый символ должен быть буквой или цифрой, и первым символом должна быть буква.

source: Next: Substituting libraries.
ru_ru: Далее: Подстановка библиотек.

source: The Centered option centers the spine so it goes in roughly equal directions left and right.
ru_ru: Вариант По центру центрирует стержень так, что он примерно одинаково уходит направо и налево.

source: The number of indexed inputs to the priority encoder will be 2selectBits.
ru_ru: Количество нумерованных входов шифратора приоритетов будет равно 2Выбирающие_биты.

source: If the selected components don't all have the same value for the attribute, then the displayed value will be blank.
ru_ru: Если выделенные компоненты не имеют общего значения для атрибута, то отображаемое значение будет пустым.

source: You can specify a memory image file at the command line, which will be loaded into any RAM component in the circuit before simulation begins.
ru_ru: Вы можете задать файл образа памяти в командной строке, который будет загружен в компонент ОЗУ в схеме до начала моделирования.

source: Also, clicking a wire segment using the Poke tool displays the value currently carried by the wire, as described on the Wiring Tool's page.
ru_ru: Кроме того, нажатие на сегменте провода с помощью Инструмента Нажатие отображает значение, передаваемое проводом в данный момент, как описано на странице Инструмент Проводка .

source: These special symbols cannot be removed.
ru_ru: Эти специальные символы не могут быть удалены.

source: Transmission Gate
ru_ru: Передаточный вентиль

source: Now to try another combination of inputs.
ru_ru: Теперь попробуем другую комбинацию входов.

source: It uses a two-bit adder as a subcircuit and iterates using a counter through all 16 possible inputs to it.
ru_ru: Она использует двухбитный сумматор как подсхему и пробегает все 16 возможных комбинаций на входах, используя счётчик.

source: ROM
ru_ru: ПЗУ
